In [15]:
import pandas as pd

Домашнее задание

Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [16]:
movies = pd.read_csv('data/movies.csv') # DataFrame
ratings = pd.read_csv('data/ratings.csv')  # DataFrame

In [17]:
ratings['rating'].describe()

count    100004.000000
mean          3.543608
std           1.058064
min           0.500000
25%           3.000000
50%           4.000000
75%           4.000000
max           5.000000
Name: rating, dtype: float64

In [18]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [19]:
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

# Task 1

In [20]:
# inner join
#pd.merge()
movies_ratings = pd.merge(movies, ratings, on=['movieId', 'movieId'], how='inner')
movies_ratings.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,3.0,851866703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,9,4.0,938629179
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,13,5.0,1331380058
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.0,997938310
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19,3.0,855190091

In [23]:
condition = movies_ratings['rating'] == 5.0
m_r = movies_ratings[condition]
m_r.head()

,movieId,title,genres,userId,rating,timestamp
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,13,5.0,1331380058
7,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,26,5.0,1360087980
12,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,47,5.0,832228931
16,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,63,5.0,1079098216
19,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,69,5.0,1366831110

In [22]:
# merge
movie_ratings = pd.merge(movies, ratings, on=['movieId', 'movieId'], how='inner')
movie_ratings.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,3.0,851866703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,9,4.0,938629179
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,13,5.0,1331380058
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.0,997938310
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19,3.0,855190091

In [10]:
m_r['title'].value_counts().head() # value_counts() - how many counts of value
# pd.Series

Shawshank Redemption, The (1994)             170
Pulp Fiction (1994)                          138
Star Wars: Episode IV - A New Hope (1977)    122
Schindler's List (1993)                      109
Godfather, The (1972)                        107
Name: title, dtype: int64

In [17]:
# groupby(), aggregation()
m_r.groupby('title').count().sort_values('movieId', ascending=False).head() # DataFrame

,movieId,genres,userId,rating,timestamp
title,,,,,
"Shawshank Redemption, The (1994)",170,170,170,170,170
Pulp Fiction (1994),138,138,138,138,138
Star Wars: Episode IV - A New Hope (1977),122,122,122,122,122
Schindler's List (1993),109,109,109,109,109
"Godfather, The (1972)",107,107,107,107,107

In [27]:
# counting the 5 rating
movie_ratings_5 = movie_ratings[movie_ratings['rating']==5.0]
movie_ratings['title'].value_counts().head()

Forrest Gump (1994)                          341
Pulp Fiction (1994)                          324
Shawshank Redemption, The (1994)             311
Silence of the Lambs, The (1991)             304
Star Wars: Episode IV - A New Hope (1977)    291
Name: title, dtype: int64

# Task 2

In [37]:
pwr = pd.read_csv('data/power.csv')
pwr.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [58]:
print(pwr['year'].max())
print(pwr['year'].min())

2014
1990

In [59]:
print(pwr['year'].std())

7.167344581292447

In [60]:
pwr.corr()

              year  quantity  category
year      1.000000 -0.000206  0.000810
quantity -0.000206  1.000000 -0.002261
category  0.000810 -0.002261  1.000000

In [38]:
pwr.shape

(1189482, 4)

In [39]:
pwr['country'].unique()[:5]

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France'], dtype=object)

In [44]:
countries = ['Lithuania', 'Latvia', 'Estonia']
categories = [4, 12, 21]
# 2005 2010
condition_1 = pwr['country'].isin(countries) # isin()
condition_2 = pwr['category'].isin(categories)
condition_3 = pwr['year'] >= 2005
condition_4 = pwr['year'] <= 2010
condition_5 = pwr['quantity'] >= 0

pr = pwr[condition_1 & condition_2 & condition_3 & condition_4 & condition_5]
pr.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [45]:
sum_quant = pr['quantity'].sum()
print(sum_quant)

240580.0

# Task 3

In [46]:
table = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')

In [47]:
type(table)

list

In [48]:
table[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 400,"-0,8%",Nasdaq,13 973,"-0,3%",Биткойн,45 078,"0,3%",USD/RUB,739053,"0,0%"
1,РТС,1 448,"-0,7%",S&P500,3 910,"0,0%",Нефть,611,"-0,1%",EUR/RUB,895930,"0,0%"
2,Dow,31 438,"0,2%",FTSE100,6 524,"-0,1%",Золото,1 838,"-0,3%",EUR/USD,12123,"0,0%"

In [50]:
table[1].head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1016978,-,1022006,"-0,49 %",-05028,18:00:00
1,NaN,EUR/RUB,893440,-,895850,"-0,27 %",-02410,18:00:00
2,NaN,USD/RUB,736210,-,738989,"-0,38 %",-02779,18:00:00
3,NaN,JPY/RUB,07033,-,07065,"-0,46 %",-00033,18:00:00
4,NaN,CNY/RUB,113996,-,114450,"-0,40 %",-00453,17:59:00